app/controllers/post_comments_controller.rb

DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."post_image_id" = ? LIMIT ?  [["id", 1], ["post_image_id", 1], ["LIMIT", 1]]
---
  def destroy
    PostComment.find_by(id: params[:id], post_image_id: params[:post_image_id]).destroy